---
kind: other
id: Methods.T:Autodesk.Revit.DB.PartMaker
source: html/dd83d368-d0c9-e73f-bb88-229c4624fb48.htm
---
# PartMaker Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.